## 라이브러리 로드

In [17]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as pd

In [18]:
print(pd.__version__)
print(sns.__version__)

1.20.1
0.11.1

In [ ]:
# 0.11.0 버전에서 변화가 많으니 이 버전 이상을 사용해 주세요. 
# !pip install seaborn --upgrade

## 데이터셋 불러오기
<img src="https://pandas.pydata.org/docs/_images/02_io_readwrite.svg">

In [19]:
# df
df = sns.load_dataset('mpg')
df.shape

(398, 9)

In [20]:
# index 값만 보기
df.index

RangeIndex(start=0, stop=398, step=1)

In [21]:
# columns 값만 보기
df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')

In [22]:
# values 값만 보기
df.values

array([[18.0, 8, 307.0, ..., 70, 'usa', 'chevrolet chevelle malibu'],
       [15.0, 8, 350.0, ..., 70, 'usa', 'buick skylark 320'],
       [18.0, 8, 318.0, ..., 70, 'usa', 'plymouth satellite'],
       ...,
       [32.0, 4, 135.0, ..., 82, 'usa', 'dodge rampage'],
       [28.0, 4, 120.0, ..., 82, 'usa', 'ford ranger'],
       [31.0, 4, 119.0, ..., 82, 'usa', 'chevy s-10']], dtype=object)

In [23]:
# 데이터 타입만 보기
df.dtypes

mpg             float64
cylinders         int64
displacement    float64
horsepower      float64
weight            int64
acceleration    float64
model_year        int64
origin           object
name             object
dtype: object

## 데이터셋 일부만 가져오기

In [24]:
# head 을 통해 일부만 가져오기
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [25]:
# tail 을 통해 일부만 가져오기
df.tail()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [27]:
# sample을 통해 일부만 가져오기
df.sample(3, random_state=42)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
198,33.0,4,91.0,53.0,1795,17.4,76,japan,honda civic
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
33,19.0,6,232.0,100.0,2634,13.0,71,usa,amc gremlin

In [39]:
# 비율로 가져오기
df.sample(frac=0.01, random_state=42)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
198,33.0,4,91.0,53.0,1795,17.4,76,japan,honda civic
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
33,19.0,6,232.0,100.0,2634,13.0,71,usa,amc gremlin
208,13.0,8,318.0,150.0,3940,13.2,76,usa,plymouth volare premier v8

# 컬럼 위치 수정하는 방법

In [38]:
df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'name'],
      dtype='object')

In [37]:
df[['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'origin', 'name', 'model_year' ]]

,mpg,cylinders,displacement,horsepower,weight,acceleration,origin,name,model_year
0,18.0,8,307.0,130.0,3504,12.0,usa,chevrolet chevelle malibu,70
1,15.0,8,350.0,165.0,3693,11.5,usa,buick skylark 320,70
2,18.0,8,318.0,150.0,3436,11.0,usa,plymouth satellite,70
3,16.0,8,304.0,150.0,3433,12.0,usa,amc rebel sst,70
4,17.0,8,302.0,140.0,3449,10.5,usa,ford torino,70
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,usa,ford mustang gl,82
394,44.0,4,97.0,52.0,2130,24.6,europe,vw pickup,82
395,32.0,4,135.0,84.0,2295,11.6,usa,dodge rampage,82
396,28.0,4,120.0,79.0,2625,18.6,usa,ford ranger,82
397,31.0,4,119.0,82.0,2720,19.4,usa,chevy s-10,82

## 요약하기

In [28]:
# info 를 통해 요약정보 보기
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

## 결측치 확인

In [30]:
# 결측치 수 확인
df.isnull().sum()

mpg             0
cylinders       0
displacement    0
horsepower      6
weight          0
acceleration    0
model_year      0
origin          0
name            0
dtype: int64

In [34]:
# 결측치 비율 확인
df.isnull().mean() * 100

mpg             0.000000
cylinders       0.000000
displacement    0.000000
horsepower      1.507538
weight          0.000000
acceleration    0.000000
model_year      0.000000
origin          0.000000
name            0.000000
dtype: float64

## 기술통계

In [35]:
# describe 로 기술통계 확인하기
df.describe()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [40]:
df.describe(include='object')

       origin        name
count     398         398
unique      3         305
top       usa  ford pinto
freq      249           6

## Series

In [43]:
# 반환값이 수치임으로 DataFrame으로 보기위해서 df로 묶는게 아니라 [['mpg']]로 묶어야지 DataFrame으로 볼 수 있다.
df['mpg']

0      18.0
1      15.0
2      18.0
3      16.0
4      17.0
       ...
393    27.0
394    44.0
395    32.0
396    28.0
397    31.0
Name: mpg, Length: 398, dtype: float64

## DataFrame

In [46]:
df[['mpg']]

      mpg
0    18.0
1    15.0
2    18.0
3    16.0
4    17.0
..    ...
393  27.0
394  44.0
395  32.0
396  28.0
397  31.0

[398 rows x 1 columns]

## loc

In [49]:
# loc 로 하나의 행을 가져옵니다.
df.loc[0]

mpg                                  18.0
cylinders                               8
displacement                        307.0
horsepower                          130.0
weight                               3504
acceleration                         12.0
model_year                             70
origin                                usa
name            chevrolet chevelle malibu
Name: 0, dtype: object

In [50]:
# loc로 2개의 행을 가져와 봅니다.
df.loc[[0,1]]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320

In [53]:
df.loc[0, 'mpg']

18.0

In [51]:
# loc로 행, 열을 가져와 봅니다.
df.loc[[0,1], 'mpg']

0    18.0
1    15.0
Name: mpg, dtype: float64

In [52]:
# loc로 여러개의 행, 열을 가져와 봅니다.
df.loc[[0,1], ['mpg', 'cylinders']]

    mpg  cylinders
0  18.0          8
1  15.0          8